<?php
defined('BASEPATH') OR exit('No direct script access allowed');

class Mock_Model
{
    private $acer_txt;
    private $asus_txt;
    private $samsung_txt;
    private $sony_txt;
    private $xiaomi_txt;

    public function __construct()
    {
        $this->acer_txt = '
        我是ACER的愛用者, 說真的還真堅固耐用, 但是在手機這塊市場卻遲遲無法讓我下手.....有點小憾.


        迷信wintel勝利方程式的acer，打不進手機市場，直接放棄



從去年開始發表一些不錯的手機我都有在關注.....只是有些只在國外上市；有的上市日期還遙遙無期!!



台灣通路最新還是630系列，看了我也是醉了!!





        因為沒有人才，缺乏研發手機的核心競爭力。儘管前幾年王振堂併購了倚天資訊公司，但也未能發揮經營綜效，做出來的 Windows 手機根本沒有競爭力，之後也沒能搭上 Android 的風潮，自然就缺了這一塊拼圖。


        marketing & RD 都不用心？
Acer Liquid Home
要把 app 弄到評分只有 2.8 也是不容易。


        2016年末，新手機設計2GB RAM是要賣給誰？大電量不錯，但配2GB就是死棋。


        in30000 wrote:
2016年末，新手...(恕刪)
長期以來台灣3c產業不是代工至上,
不然就是老二主義,先看風向,有人推出的功能才接著推出,
規格完全不敢跑第一.
甚是規格又老又臭.但自己還自信滿滿
也因如此.手機平板龍頭都讓給外國人了
        https://www.youtube.com/user/3354977

        GWOKING wrote:
長期以來台灣3c產業...(恕刪)

難怪每次都會有相見恨晚的錯覺，


        手機無設計感

產品沒有延續性

除了低價市場
        ';
        $this->asus_txt = '
        請問有碰巧拿過zf3 5.5吋
以及紅米NOTE3全頻版的網友嗎？
兩者都5.5吋剛好在我的甜蜜點

這兩隻在google導航定位準確嗎？
我大路癡，導航必備
以及wifi與4G在相同地點哪個收訊會比較好?

相機不介意，旅遊會帶單眼
音質不在意，我只聽的出大小聲

平時就轉神魔以及pokemon而已
沒在玩大型3D遊戲

有拿過這兩隻的，會建議入手哪個呢？
再次感謝


         k0904320 wrote:
請問有碰巧拿過zf3...(恕刪)

兩隻都拿過，導航跟遊戲都建議zf3

先說導航，同樣地點

家裡離窗一公尺，zf3秒定

n3要靠窗才能定

同事車隔熱紙會擋gps訊號

zf3關窗秒定，n3要開窗伸出去才能定(車內關窗開定位三分鐘還是無法定位)

再說遊戲，理論上n3gpu比zf3強

但你玩的神魔卻是他的致命傷

容易當機跟斷珠，zf3沒這問題

神魔不太吃gpu強弱差別

另一個遊戲沒玩過就無法評論了


         愛吃牛肉麵的老王 wrote:
兩隻都拿過，導航跟遊...(恕刪)

謝謝老王兄，非常有參考價值
感恩!


         如你不考慮價格,ZF3 優先選擇,兩支家人都有,軟體調教及遊戲流暢穩定度是優於紅米Note3.


         pbf888 wrote:
如你不考慮價格,ZF...(恕刪)

謝謝888兄
我會好好考慮zf3的
YouTube 看介紹感覺滿好的


         星期六下午去買了

目前感覺還不錯

只是有個功能不知有沒有

就是關掉鎖定螢幕，直接進主畫面

不要再上拉一下解鎖




         k0904320 wrote:
星期六下午去買了目前...(恕刪)

我紅n3 指紋解鎖就進主畫面了

zf3應該也是這樣吧



k0904320 wrote:
星期六下午去買了目...(恕刪)

設定/鎖定螢幕/螢幕鎖定/無

即可完成無鎖定狀態，誰拿到手機都不必輸入密碼之類的，即可使用。
--
設定/zenmotion/觸控手勢/雙擊關閉、喚醒都開啟

即可完成雙擊喚醒螢幕 或 關閉
ps在操作視窗中如可見上面通知欄，可直接雙擊通知欄關閉螢幕

======
如果要用指紋鎖，不想讓人隨意拿到手機就能用：

設定/指紋/管理指紋/選定一個"備用的鎖定方式"然後依序設定完成指紋

即可使用背後指紋辯識喚醒螢幕。
ps.此時雙擊喚醒則會跳至備用鎖定。


         王肥宅 wrote:
我紅n3 指紋解鎖就...(恕刪)

我把指紋辨識關閉了
我習慣螢幕點兩下@@


         thesamei wrote:
設定/鎖定螢幕/螢幕...(恕刪)

謝謝教導
之前都買HTC 習慣設定指令在哪裡
換個廠牌頭都昏了
感謝你
        ';
        $this->samsung_txt = '
        我的三星J7是今年5月買的，在這周開始就會不定時的發生重新開機問題，這幾天我是懷疑記憶體不足所以刪了一些軟體及照片，但問題還是存在.......。昨天不經意發現只要我有敲擊機身就會重新開機，力量大約是拍打手心不會痛的程度，我現在是猜想是否跟電池有關。想請問各位前輩是否有遇到這類的問題，是怎麼排除的？
這兩天應該會把手機送回手機行確認，通常維修時間會是多久呢？


              三天左右除非缺料林肯尼1231 wrote:
我的三星J7是今年5...(恕刪)


              同學的j3是搖一搖就會重開機


              林肯尼1231 wrote:
我的三星J7是今年5...(恕刪)
http://www.samsung.com/tw/support/channels/
修過幾次經驗 沒遇到缺料 都是當天修好通知取機(下午以前送修)
這是三星原廠授權的售後服務中心,維修件也都是送往這裡維修,自己親自直接送往會比通訊行還快...
通訊行很會拖,連個NP案件都可以拖個好幾天才送給電信業者,而且也不知道他們會不會送去外面彷間私人維修店的風險,非原廠授權的拆機維修是沒有保固的


              也是要看是那家的保固，三星維修服務中心只收自家直營門市買的，看手機保固標籤是那家的神腦丟去中華電信或神腦國際，台哥大，fet就丟那二家他們有自己維修中心時間就如我上面說的芒果香茅 wrote:
http://www...(恕刪)


              a5263922 wrote:
也是要看是那家的保固，三星維修服務中心只收自家直營門市買的，看手機保固標籤是那家的神腦丟去中華電信或神腦國際，台哥大，fet就丟那二家他們有自己維修中心時間就如我上面說的(恕刪)

電信商(神腦/全虹/台哥大)/代理商(聯強)的保固不影響三星服務中心的保固
但只要經過三星原廠維修過的產品,原本的代理商或電信商的保固就會失去,之後只能找三星原廠售後
我的忘了是全虹還是台哥大保固的,就是兩個其中一個,但我第一次手機遇到問題就直接送往三星服務中心維修,它們也沒拒收,好像有告知會喪失代理商的保固這樣而已
只要是台灣三星的公司貨不管誰代理保固的,最終找他們售後保固它們要照收也不會拒收,水貨我就不知道了


              如果能到維修站，可以打電話預約有料件再去當天就好
        ';
        $this->sony_txt = '
        有一樣拿XZ 的朋友用上手機套 溫度就掛了嗎？


        KUBISA wrote:
有一樣拿XZ 的朋友...(恕刪)




        KUBISA wrote:
有一樣拿XZ 的朋友...(恕刪)



        這溫度算中低,比起Z5之前的機種常超過60℃,以CPU使用率達九成來看,已經控制得很好了


        可以善用編輯文章功能嗎
一個主題佔三樓是怎樣…

還有完全看不出來怎樣了
溫度50℃很高？
以cpu來說這很正常

還有你裝的那些管理監控軟體
都可以刪了
吃資源而已


        我有點不明白的是第三篇，發一個皮套圖的用意是什麼？

50度還好，不要一直持續我想都沒問題的。



        寂靜^幻想 wrote:
可以善用編輯文章功能...(恕刪)

+1
監控軟體本身就是佔用資源的耗電程式!


        不知道樓主發這篇的用意是什麼?
這篇文章一點意義也沒有...

倒是想請教樓主...
有那一顆CPU的全核心滿載下不會超過50度的?
(剛開始全核心滿載不算喔)


        穿衣服覺得熱時
第一個想到的是衣服穿太厚了
還是自己發燒了??


        hayato-tw wrote:
穿衣服覺得熱時第一...(恕刪)


大大您的比喻真是他(嗶...)的讚讚讚讚讚讚讚讚讚讚讚讚讚讚!


對了.目前play商店裡面的什麼手機管理程式啦
記憶體管理啦.防毒啦.垃圾清除程式啦叭啦叭啦的那些...


完.全.都.是.耗.資.源.的.東.西


特別是防毒.都是恐嚇你裝然後花錢升級

小弟都用過.都無意義.都耗資源

不過信者恆信啦w
        ';
        $this->xiaomi_txt = '
        想請教一下兩隻用起來有什麼差別嗎

聽說陸版的小米很多廣告.目前是不是還沒有台版的rom可以刷入呢

最近在想要買哪一隻@@





pcman2004 wrote:
想請教一下兩隻用起...(恕刪)

台灣也有賣Mi Max，雖然是S650,3/32GB版，至少有保固。

中國版水貨64g(S652,3/64GB)沒什大差別啦。

不Care保固，就RMB 1499買中國版。
很Care保固，就NT 6999買台版。
要有內建Google App，就買台版，多那個32GB容量，就看你用得到嗎。

2支都是中低階產品，沒差啦。

不要再考慮了，再考慮，新機又要出來了。

你問，目前是不是還沒有台版的rom可以刷入。

你還是買台版好了。


              我有買陸版的高配版，裡面的廣告可以關掉，不過小米官方活動的廣告目前找不到地方關，可以安裝google架構，另外他內建的是小米應用商店，如果從google store下載的程式，內購會錯誤

其他用起來都差不多


              高配已經有國際穩定版可以刷了，到en.miui.com就抓得到。


              IUUaena0516 wrote:
高配已經有國際穩定版可以刷了，到en.miui.com就抓得到。


Version: V8.0.6.0.MBECNDG (MIUI8) Size: 1.1G   並不是國際穩定版.

它只是大陸穩定版!!
        ';
    }

    public function get_acer_txt() : string
    {
        return $this->acer_txt;
    }

    public function get_asus_txt() : string
    {
        return $this->asus_txt;
    }

    public function get_samsung_txt() : string
    {
        return $this->samsung_txt;
    }

    public function get_sony_txt() : string
    {
        return $this->sony_txt;
    }

    public function get_xiaomi_txt() : string
    {
        return $this->xiaomi_txt;
    }
}
